app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "todos"
---
  def index
    per_page = params[:per_page] || 2
    page = params[:page] || 1
    @total_pages = (Todo.count.to_f / per_page.to_i).ceil

INSERT INTO "todos" ("title", "body", "completed", "created_at", "updated_at", "priority") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Brunch"], ["body", "Eating Brunch"], ["completed", false], ["created_at", "2024-01-13 12:39:18.198780"], ["updated_at", "2024-01-13 12:39:18.198780"], ["priority", nil]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

UPDATE "todos" SET "completed" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["completed", true], ["updated_at", "2024-01-12 07:40:09.766048"], ["id", 49]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 3]]
---
  def destroy
    @todo.destroy!